log = print


# s21day01作业
#
# 1.
# 操作系统的作用?


# 2.
# 列举你听过的操作系统及区别？


# 3.
# 列举你了解的编码及他们之间的区别？


# 4.
# 列举你了解的Python2和Python3的区别？


# 5.
# 你了解的python都有那些数据类型？


# 6.
# 补充代码，实现以下功能。
# 要求输出  alex"烧饼
# log('alex"烧饼')


# 7.
# 用print打印出下面内容：
# ⽂能提笔安天下,
# 武能上⻢定乾坤.
# ⼼存谋略何⼈胜,
# 古今英雄唯是君。
# log("""
# ⽂能提笔安天下,
# 武能上⻢定乾坤.
# ⼼存谋略何⼈胜,
# 古今英雄唯是君。""")


# 8.
# 变量名的命名规范和建议？
#
# - 只能由数字、字母、下划线组成
# - 开头不能是数字
# - 不能是python的关键字
# - 建议
# - 见名知意


# 9.
# 如下那个变量名是正确的？
# name = '武沛齐'
# _ = 'alex'
# _9 = "老男孩"
# 9
# name = "景女神"
# oldboy(edu=666


# 10.
# 简述你了解if条件语句的基本结构。


# 11.
# 设定一个理想数字比如：66，让用户输入数字，如果比66大，则显示猜测的结果大了；如果比66小，则显示猜测的结果小了;
# 只有等于66，显示猜测结果正确。


# 12.
# 提⽰⽤户输入⿇花藤.判断⽤户输入的对不对。如果对, 提⽰真聪明, 如果不对, 提⽰你
# 是傻逼么。


