# 1. 暴力摩托程序（完成下列需求）：
#
#    1. 创建三个游戏人物，分别是：
#
#       ​	苍井井，女，18，攻击力ad为20，血量200
#
#       ​	东尼木木，男，20，攻击力ad为30，血量150
#
#       ​	波多多，女，19，攻击力ad为50，血量80
#
#    2. 创建三个游戏武器，分别是：
#
#       1. 平底锅，ad为20
#       2. 斧子，ad为50
#       3. 双节棍，ad为65
#
#    3. 创建三个游戏摩托车，分别是：
#
#       1. 小踏板，速度60迈
#       2. 雅马哈，速度80迈
#       3. 宝马，速度120迈
#
#  完成下列需求（利用武器打人掉的血量为武器的ad + 人的ad）：
#
# ​	（1）苍井井骑着小踏板开着60迈的车行驶在赛道上。
#
# ​	（2）东尼木木骑着宝马开着120迈的车行驶在赛道上。
#
# ​	（3）波多多骑着雅马哈开着80迈的车行驶在赛道上。
#
# ​	（4）苍井井赤手空拳打了波多多20滴血，波多多还剩xx血。
#
# ​	（5）东尼木木赤手空拳打了波多多30滴血，波多多还剩xx血。
#
# ​	（6）波多多利用平底锅打了苍井井一平底锅，苍井井还剩xx血。
#
# ​	（7）波多多利用斧子打了东尼木木一斧子，东尼木木还剩xx血。
#
# ​	（8）苍井井骑着宝马打了骑着小踏板的东尼木木一双节棍，东尼木木哭了，还剩xx血。（选做）
#
# ​	（9）波多多骑着小踏板打了骑着雅马哈的东尼木木一斧子，东尼木木哭了，还剩xx血。（选做）


# sys.argv练习
# 写一个python脚本,在cmd里执行
# python xxx.py 用户名 密码 cp 文件路径 目的地址
# python xxx.py alex sb cp D:\python_22\day22\1.内容回顾.py D:\python_22\day21
# python xxx.py alex sb rm D:\python_22\day22
# python xxx.py alex sb rename D:\python_22\day22  D:\python_22\day23


# 定义一个圆形类,半径是这个圆形的属性,实例化一个半径为5的圆形,一个半径为10的圆形
# 完成方法
# 计算圆形面积
# 计算圆形周长
# 定义一个圆环类，计算圆环的周长和面积（升级题）。
# 定义一个用户类,用户名和密码是这个类的属性,实例化两个用户,分别有不同的用户名和密码
# 登陆成功之后才创建用户对象
# 设计一个方法 修改密码
# 继续完成人狗大战
# 你是人
# 狗是一个npc
# 你一个回合  狗一个回合
# 狗掉的血是一个波动值
# 闪避概率
# 继续完成计算器
