# !/usr/bin/env python
# -*- coding:utf-8 -*-

log = print


# 1.列举常见的操作系统及公司线上服务器用的操作系统  （2’）
"""
win mac linux unix
centos
"""


# 2.简述位和字节的关系 （1'）
# 1 byte = 8 bit


# 3.is和==的区别 （2'）
# is id
# == 值


# 4.pass的作用 （1'）
# 占位


# 5.列举python2和python3的所有区别 （3'）


# 6.变量的命名规范和建议（3'）


# 7.简述深浅拷贝（3'）


# 8.解释型语言和编译型语言 （2'）


# 9.列举你了解的数据类型及他具有的方法，每种最多写5个  （5'）


# 10.列举你了解的转换为布尔值为False的常见值  （2'）
"""
'' 0 [] () set() {}
"""


# 11.简述一下三个变量的区别 （2'）
# v1 = (1) -> 1
# v2 = (1,) -> tuple
# v3 = 1 -> 1


# 12.写代码实现将字符串v='全栈21期'的反转  （3'）
# v = '全栈21期'
# log(v[::-1])


# 13.看代码写结果 （7'）
info = [
    {'k1': (1), 'k2': {'k9': 'oldboy', 'k10': '一天天'}},
    (11, 22, 33, 44),
    {199, 2, 3, 4, 5},
    True,
    ['武沛齐', '景女神', {'extra': ("alex", 'eric', [18, 20])}]
]
# 请根据索引获取上述结构中的1
# log(info[0]['k1'])

# 请根据索引获取上述结构中的'oldboy'
# log(info[0]['k2']['k9'])

# 请根据索引获取上述结构中的44
# log(info[1][3])

# 请根据索引获取上述结构中的 '天天'
# log(info[0]['k2']['k10'][1:])

# 请循环打印上述结构中的集合
# for i in info[1]:
#     log(i)
# for i in info[4][2]['extra']:
#     log(i)

# 请在上述结构中extra所在的字典中添加一个键值对，并设置键为：True，值为'真'
# info[4][2][True] = '真'
# log(info)

# 请在上述结构中[18,20]中添加一个整型元素：69
# info[4][2]['extra'][2].append(69)
# log(info)


# 14.看代码写结果 （5'）
# result = 1 > 6 and 8 < 9
# log(result)
# result = 1 or 2
# log(result)
# result = 0 or True
# log(result)
# result = 1 and 8 or True and 4
# log(result)
# result = 'Alex' or '' and 'oldboy'
# log(result)
"""
False
1
True
8
Alex
"""


# 15.写代码实现将字符串v='k1|v1,k2|v2,k3|v3....'
# 转换成字典{'k1':'v1','k2':'v2','k3':'v3'...} (5')
# v = 'k1|v1,k2|v2,k3|v3'
# dic = {}
# for i in v.split(','):
#     k, v = i.split('|')
#     dic[k] = v
# log(dic)


# 16.实现一个整数乘法计算器 （5'）


# 17.看代码写结果  （4'）
# v1 = [1, 2, 3, 4, 5]
# v2 = [v1, v1, v1]
# v2[1][0] = 111
# v2[2][0] = 222
# print(v1)
# print(v2)
"""
[222, 2, 3, 4, 5]
[[222, 2, 3, 4, 5], [222, 2, 3, 4, 5], [222, 2, 3, 4, 5]]
"""


# 18.请将info中索引值为偶数的值使用‘*’，拼接起来，并写入到文件a.log中  （5'）
# info = ['你是', '到底', '是', '不是', '一个', '魔鬼', ]
# with open('a1.log', 'w', encoding='utf-8') as f:
#     f.write('*'.join(info))


# 19.写代码实现 （10）
# 需求：读取100G的文件，检测文件中是否有关键字keys=['苍老师','小泽老师','alex'],如果有则替换成***，
# 并写入到另外一个文件中
# keys = ['苍老师', '小泽老师', 'alex']
#
# with open('100g') as f1, open('100g1', 'w') as f2:
#     for line in f1:
#         for i in keys:
#             line = line.replace(i, '***')
#         f2.write(line)


# 20.车牌区域划分，请根据车牌信息，分析各省车牌持有数量（10'）
# cars = ['鲁A32444', '鲁B12333', '京B8989M', '黑C49678', '黑C46555', '沪B25041', '黑C34567']


# 21.写代码实现：
# 需求：读取文件内容，将文件构造成如下结构：
# #data.txt文件结构如下：
# id,name,age,phone,job
# 1,alex,22,13651054608,IT
# 2,wusir,23,13304320533,Tearcher
# 3,taibai,18,1333235322,IT


# 22.请使用for循环打印9*9乘法表
#
# 1*1
# 2*1 2*2
# 3*1 3*2 3*3
# 4*1 4*2 4*3 4*4
# 5*1 5*2 5*3 5*4 5*5
# 6*1 6*2 6*3 6*4 6*5 6*6
# 7*1 7*2 7*3 7*4 7*5 7*6 7*7
# 8*1 8*2 8*3 8*4 8*5 8*6 8*7 8*8
# 9*1 9*2 9*3 9*4 9*5 9*6 9*7 9*8 9*9
#
# #温馨提示：
# 1.for循环可以嵌套
# 2.print的默认会换行，如果设置了end就不再换行。如：
# 实例一：换行显示：
# print(‘2*1’)
# print(‘2*2’)
#
# 实例二：不换行显示
# print(‘2*1’,end='')
# print(‘2*2’,end='')
# for i in range(1, 10):
#     line = ''
#     for j in range(1, i+1):
#         line += f'{i}*{j} '
#     log(line)
